Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: You'll be needing this.
hi: तुम्हें इसकी ज़रूरत पड़ेगी।

source: Why were you in my car?
hi: तुम मेरे गाड़ी में क्यों थे?

source: Why aren't they coming?
hi: वे क्यों नहीं आ रहे हैं?

source: What's your son's name?
hi: तुम्हारे बेटे का नाम क्या है?

source: What're you doing, Tom?
hi: तुम क्या कर रहे हो, टॉम?

source: We all became soldiers.
hi: हम सब सैनिक बन गये।

source: Tom didn't meet anyone.
hi: टॉम किसी से भी नहीं मिला।

source: This isn't your office.
hi: यह तुम्हारा दफ्तर नहीं है।

source: This isn't their fault.
hi: यह उनकी गलती नहीं है।

source: It isn't your decision.
hi: यह तुम्हारा फ़ैसला नहीं है।

source: Why were you arrested?
hi: तुम्हें किस लिये गिरफ़्तार किया गया था?

source: Why wasn't Tom there?
hi: टॉम वहाँ क्यों नहीं था?

source: Why aren't you there?
hi: तुम वहाँ क्यों नहीं हो?

source: Why aren't they here?
hi: वे यहाँ क्यों नहीं हैं?

source: Where are Tom's keys?
hi: टॉम की चाबियाँ कहाँ हैं?

source: What's in the basket?
hi: टोकरी में क्या है?

source: What're you counting?
hi: तुम क्या गिन रहे हो?

source: Tom thinks I'm right.
hi: टॉम को लगता है मैं सही हूँ।

source: Tom says he's hungry.
hi: टॉम कहता है उसे भूक लगी है।

source: Tom knows we're here.
hi: टॉम जानता है हम यहाँ हैं।

source: Tom isn't that crazy.
hi: टॉम उतना भी पागल नहीं है।

source: This is Tom's school.
hi: यह टॉम की पाठशाला है।

source: It isn't Tom's fault.
hi: टॉम की गलती नहीं थी।

source: Isn't that Tom's hat?
hi: वह टॉम की टोपी है, ना?

source: I'm extremely hungry.
hi: मुझे बड़े ज़ोरों की भूख लगी है।

source: How's your wife, Tom?
hi: तुम्हारी बीवी कैसी है, टॉम?

source: You have one chance.
hi: तुम्हारे पास एक मौका है।

source: Why did Tom do that?
hi: टॉम ने वैसा क्यों किया?

source: Where have you gone?
hi: कहाँ चले गए हो?

source: What's Tom done now?
hi: अब क्या किया है टॉम ने?

source: What's ours is ours.
hi: जो हमारा है वह हमारा है।

source: What's in your hand?
hi: तुम्हारे हाथ में क्या है?

source: What's in the truck?
hi: ट्रक में क्या है?

source: We've met only once.
hi: हम बस एक बार मिले हैं।

source: Tom's now in a coma.
hi: टॉम अभी कोमा में है।

source: Tom says he's dying.
hi: टॉम कहता है वह मर रहा है।

source: Tom said you'd know.
hi: टॉम ने कहाँ तुम्हें पता होगा।

source: Tom said you'd come.
hi: टॉम ने कहाँ तुम आओगे।

source: Tom lowered his gun.
hi: टॉम ने अपनी बंदूक नीचे की।

source: Tom knows I'm right.
hi: टॉम जानता है मैं सही हूँ।

source: Tom isn't even here.
hi: टॉम तो यहाँ है भी नहीं।

source: Tom can't help Mary.
hi: टॉम मैरी की मदद नहीं कर सकता।

source: Tom can't find them.
hi: टॉम को वे नहीं मिल रहें।

source: This isn't your job.
hi: यह तुम्हारा काम नहीं है।

source: They're old friends.
hi: वे पुराने दोस्त हैं।

source: How's it going, Tom?
hi: क्या हाल है, टॉम?

source: Drink your tea, Tom.
hi: अपनी चाय पियो, टॉम।

source: Aren't you a doctor?
hi: तुम डाक्टर हो, ना?

source: Are those your kids?
hi: क्या वे आपके बच्चे हैं?

source: Who's with Tom now?
hi: अभी टॉम के साथ कौन है?

source: Where's Tom anyway?
hi: वैसे टॉम है कहाँ?

source: What's in the file?
hi: फ़ाईल में क्या है?

source: Were you a soldier?
hi: क्या आप सैनिक थे?

source: We're not dead yet.
hi: हम अभी तक मरें नहीं हैं।

source: We need Tom's help.
hi: हमें टॉम के मदद की ज़रूरत है।

source: Tom won't eat meat.
hi: टॉम मांस नहीं खाएगा।

source: Tom isn't to blame.
hi: टॉम दोषी नहीं है।

source: Tom isn't safe yet.
hi: टॉम अभी तक सुरक्षित नहीं है।

source: Tom isn't like you.
hi: टॉम तुम्हारी तरह नहीं है।

source: Tom isn't in there.
hi: टॉम वहाँ अंदर नहीं है।

source: Tom can't stand up.
hi: टॉम खड़ा नहीं हो सकता।

source: Time's on our side.
hi: वक़्त हमारे साथ है।

source: This isn't my book.
hi: यह मेरी किताब नहीं है।

source: It's in your truck.
hi: तुम्हारे ट्रक में है।

source: It's in your hands.
hi: तुम्हारे हाथों में है।

source: Is this Tom's room?
hi: क्या यह टॉम का कमरा है?

source: How long's it been?
hi: कितनी देर हुई है?

source: How is your sister?
hi: तुम्हारी बहन कैसी है?

source: You could've gone.
hi: तुम जा सकते थे।

source: You could've died.
hi: तुम मर सकते थे।

source: Why isn't it here?
hi: यहाँ क्यों नहीं है?

source: Why is Tom scared?
hi: टॉम डरा हुआ क्यों है?

source: Who is Tom anyway?
hi: वैसे टॉम है कौन?

source: Where's my driver?
hi: मेरा ड्राइवर कहाँ है?

source: What've you found?
hi: तुम्हें क्या मिला है?

source: What did Tom mean?
hi: टॉम का क्या मतलब था?

source: Tom isn't up here.
hi: टॉम यहाँ उपर नहीं है।

source: Tom has seen this.
hi: टॉम ने यह देखा है।

source: Tom could've gone.
hi: टॉम जा सकता था।

source: This isn't my car.
hi: यह मेरी गाड़ी नहीं है।

source: Listen to me, Tom.
hi: मेरी बात सुनो, टॉम।

source: It's in my pocket.
hi: मेरी जेब में है।

source: It's been decided.
hi: तय हुआ है।

source: I need Tom's help.
hi: मुझे टॉम के मदद की ज़रूरत है।

source: How does Tom know?
hi: टॉम को कैसे पता?

source: How did Tom do it?
hi: टॉमने कैसे किया?

source: Give Tom the disk.
hi: टॉम को डिस्क दे दो।

source: You could've run.
hi: तुम भाग सकते थे।

source: Why is Tom going?
hi: टॉम क्यों जा रहा है?

source: We need you, Tom.
hi: हमें तुम्हारी ज़रूरत है, टॉम।

source: Tom isn't so bad.
hi: टॉम उतना भी बुरा नहीं है।

source: Tom isn't in bed.
hi: टॉम बिस्तर पर नहीं है।

source: Tom drives a cab.
hi: टॉम टैक्सी चलाता है।

source: Tom can show you.
hi: टॉम तुम्हें दिखा सकता है।

source: Tom can help you.
hi: टॉम तुम्हारी मदद कर सकता है।

source: That was our job.
hi: वह हमारा काम था।

source: Tell that to Tom.
hi: वह टॉम को बताओ।

source: It's not for you.
hi: तुम्हारे लिये नहीं है।

source: It's my decision.
hi: मेरा फ़ैसला है।

source: It's a bad habit.
hi: बुरी आदत है।

source: Is that you, Tom?
hi: टॉम, तुम हो?

source: I'm not so tired.
hi: मैं उतना भी थका हुआ नहीं हूँ।

source: How did Tom know?
hi: टॉम को कैसे पता था?

source: You're so weird.
hi: तुम कितने अजीब हो।

source: Where's my room?
hi: मेरा कमरा कहाँ है?

source: Where's my coat?
hi: मेरा कोट कहाँ है?

source: What do we want?
hi: हमें क्या चाहिए?

source: We all know Tom.
hi: हम सब टॉम को जानते हैं।

source: Tom was at home.
hi: टॉम घर पर था।

source: Tom took my car.
hi: टॉम ने मेरी गाड़ी ली।

source: Tom has a horse.
hi: टॉम के पास एक घोड़ा है।

source: Tom cried a lot.
hi: टॉम बहुत रोया।

source: Tom can't go in.
hi: टॉम अंदर नहीं जा सकता।

source: Tom can't do it.
hi: टॉम नहीं कर सकता।

source: You're so lazy.
hi: कितने आलसी हो तुम।

source: Tom did it all.
hi: टॉम ने सभ कुछ किया।

source: Show it to her.
hi: उसे दिखाओ।

source: Tom has a gun.
hi: टॉम के पास एक बंदूक है।

source: Tom had a gun.
hi: टॉम के पास एक बंदूक थी।

source: It was Tom's.
hi: टॉम का था।

source: She's a fan of Sex and the City.
hi: वह "सेक्स एंड द सिटी" की शौकीन है।

source: I can eat.
hi: मैं खा सकता हूँ।

source: She can swim.
hi: वह तैर सकती है।

source: Emily can swim.
hi: एमिली तैर सकती है।

source: She has been with me through the ebb and flow of my fortunes.
hi: वे मेरी किस्मत के उतार चढ़ाव में लगातार मेरे साथ रहीं हैं।

source: The conditions that lead to my parents' divorce were engendered by their obsessive attitude toward work.
hi: मेरे माता-पिता के विवाह विच्छेद के हालात उनके काम के प्रति अत्याधिक लगाव से पैदा हुए थे।

source: What are you going to wear?
hi: क्या पहनने वाले हो?

source: Her first answer was laudable.
hi: उनका पहला जवाब प्रशंसनीय था।

source: His first answer was laudable.
hi: उनका पहला जवाब प्रशंसनीय था।

source: Nancy received much solace from the cards and phone calls received from friends in the weeks after her husband died.
hi: अपने पति की मृत्यु के बाद मित्रों के फोन और पत्रों से नेन्सी को काफी सांत्वना मिली।

source: Their efforts to curtail spending didn't quite succeed.
hi: उनके खर्च घटाने के प्रयास ज़्यादा सफल नहीं हुए।

source: This is going to sound completely fatuous, but it's my honest answer.
hi: यह पूरी तरह से ऊटपटाँग लग सकता है, लेकिन यह मेरी ओर से दिया गया ईमानदार उत्तर है।

source: The depredations of human hunters are thought to have been the key factor that pushed many species to extinction.
hi: ऐसा माना जाता है कि मानव शिकारियों द्वारा की गई लूटमार ही अनेक प्रजातियों के लुप्त होने का बड़ा कारण है।

source: It is, however, apposite to note that this process will continue in the year ahead.
hi: तथापि, यह नोट करना उपयुक्त है कि यह प्रक्रिया अगले वर्ष जारी रहेगी।

source: Apart from hearing sporadic gunfire, the day was pretty quiet.
hi: इक्का-दुक्का गोलीबारी की आवाज सुनने के अलावा दिन भर काफी शांति बनी रही।

source: I know that the opposition member might be wrong.
hi: मैं जानता हूं कि विरोधी सदस्य गलत हो सकता है।

source: I don't want to refute this outworn idea.
hi: मैं उसके घिसे-पिटे विचार का खंडन नहीं करना चाहता हूं।

source: He had found shortcomings in the repair.
hi: उसने मरम्मत में कमियां पाई थीं।

source: No circumstance, no purpose, no law whatsoever can ever make licit an act which is intrinsically illicit.
hi: कोई परिस्थिति, कोई उद्देश्य, किसी भी प्रकार का कोई कानून, किसी अंतर्निहित रूप से अवैध कार्य को कभी वैध नहीं बना सकता है।

source: What's more surprising?
hi: अधिक आश्चर्य की बात क्या है?

source: I am so disappointed.
hi: मुझे इतनी अधिक निराशा हुई है।

source: In India, you can find many saints in the Himalayan region who could be called prescient.
hi: भारत में आप हिमालय क्षेत्र में ऐसे अनेक साधुओं को देख सकते हैं जिन्हें भविष्यदर्शी कहा जा सकता है।

source: Neither wild nor domestic animals appear to have any premonition of death.
hi: न तो वन्य जीवों और न ही घरेलू जीवों को मृत्यु का पूर्वाभास होता है।

source: There can never be peace without justice.
hi: बिना न्याय के शांति नहीं हो सकती है।

source: In metro cities, the local population mingles freely with visitors.
hi: महानगरों में स्थानीय जनता आगन्तुकों के साथ स्वतंत्रता पूर्वक घुल-मिल जाती है।

source: He always got in a fight with his mother in the movie.
hi: वह फिल्म में हमेशा अपनी मां से झगड़ता रहता था।

source: He betrays his king and country.
hi: वह अपने राजा तथा देश के साथ गद्दारी करता है।

source: The village head decided to build a large granary to protect the grain from the weevils.
hi: गांव के प्रधान ने अनाज को घुन आदि से बचाने के लिए एक विशाल अन्नागार बनाने का निर्णय किया।

source: The police tried hard to unravel the mystery of killing.
hi: पुलिस ने हत्या की गुथी को सुलझाने के लिए कड़ा प्रयास किया।

source: The criminal disclosed all the facts of the case eventually.
hi: अंततः अपराधी ने मामले के सभी तथ्यों को उजागर कर दिया।

source: We are working against an enemy who is very insidious in his methods.
hi: हम एक ऐसे दुश्मन के विरुद्ध काम कर रहे हैं जो कपटपूर्ण विधियां अपनाने में प्रवीण है।

source: You could see the weevils that have infested the rice.
hi: आप चावल में लगे घुन को देख सकते थे।

source: Some children thought that they could compose a lullaby, paint a picture, or make a teddy bear.
hi: कुछ बच्चों ने यह सोचा कि वे लोरी रच सकते हैं, तस्वीर में रंग भर सकते हैं या टैड्डी बियर बना सकते हैं।

source: The burglars gagged the home owner and tied him to a chair.
hi: चोरों ने घर के मालिक का मुंह बंद कर दिया तथा उसे कुर्सी से बाँध दिया।

source: Your letter was received on 29th ultimo.
hi: आपका पत्र पिछले महीने की २९ तारीख को प्राप्त हुआ।

source: You can hear animals yammer in the meadows.
hi: आप चारागाहों में जानवरों के रिरियाने की आवाज़ों को सुन सकते हैं।

source: Add the rice and cook gently until the grains begin to turn translucent.
hi: चावल डालें और धीरे-धीरे उस समय तक पकाएं जब तक कि दानें पारभासी (स्वच्छ) न हो जाएं।

source: In the play, the actor suddenly transmogrified into a monster.
hi: नाटक में कलाकार अचानक से दैत्य में परिवर्तित हो गया।

source: We simply didn't expect to see such filth on the family shopping site.
hi: हमने पारिवारिक शापिंग साइट पर इस प्रकार की अश्लीलता देखने की कभी कल्पना नहीं की थी।

source: The most commonly reported flu symptoms are fever, chills, sweating, astheania, headache and nausea.
hi: फ्लू के सर्वाधिक सामान्य लक्षणों में ज्वर, ठंड लगना, पसीना, शक्तिहीनता, सिरदर्द और मतली शामिल हैं।

source: Please keep your ludicrous accusations to yourself in future.
hi: कृपया भविष्य में अपने बेतुके दोषारोपणों को अपने पास ही रखें।

source: He is a jack of all trades.
hi: वह हरफनमौला है।

source: Defeat him.
hi: उसे शिकस्त दो!

source: My orders should be carried out.
hi: मेरे हुक्म की तामील की जाय।

source: What's the meaning of this word?
hi: इस अल्फाज का मतलब क्या है?

source: I am handicapped.
hi: मैं एक अपाहिज हूँ।

source: Establish contact with me tomorrow.
hi: मुझसे कल संपर्क स्थापित करना।

source: She is a vivid, playful and fiery girl.
hi: वह शोख, चंचल और तेज तर्रार लडकी है।

source: I want shelter.
hi: मुझे पनाह चाहिए!

source: It is a question of my bread and butter.
hi: यह मेरी रोजी-रोटी का सवाल है।

source: We are with you your whole life.
hi: हम आजीवन आपके साथ है।

source: An educated/literate arrogant person got into a boat.
hi: एक पढ़ा-लिखा दंभी व्यक्ति नाव में सवार हुआ।

source: I found this test difficult.
hi: मैंने इस परीक्षण को मुश्किल पाया।

source: I solved this problem with difficulty.
hi: मैने यह समस्या कठिनाई से सुलझाई।

source: The aircraft has landed at the airport.
hi: वायुयान हवाई अड्डे पर उतर गया है।

source: People are getting down.
hi: लोग उतर रहे हैं।

source: Make each day your masterpiece.
hi: अपने प्रत्येक दिन को सर्वोत्कृष्ट बनाएं।

source: It is better to die on your feet than to live on your knees.
hi: डर के जीने की तुलना में तो मर जाना ही बेहतर है।

source: The way I see it, if you want the rainbow, you gotta put up with the rain.
hi: मेरे विचार से यदि आप इन्द्रधनुष चाहते हैं, तो आपको वर्षा को सहना होगा।

source: The best dreams happen when you're awake.
hi: जब आप जागृत अवस्था में होते हैं, तो ही सर्वश्रेष्ठ स्वप्नों का सृजन होता है.

source: A baby is God's opinion that the world should go on.
hi: नन्हे शिशु के जन्म का अर्थ है कि भगवान यह चाहते हैं कि यह दुनिया बनी रहे।

source: Worthless people live only to eat and drink.
hi: निकम्मे लोग सिर्फ खाने पीने के लिए जीते हैं।

source: Anger is never without a reason, but seldom with a good one.
hi: क्रोध कभी भी बिना कारण नहीं होता, लेकिन कदाचित ही यह कारण सार्थक होता है।

source: An investment in knowledge pays the best interest.
hi: ज्ञान में पूंजी लगाने से सर्वाधिक ब्याज मिलता है।

source: We should not fret for what is past, nor should we be anxious about the future; men of discernment deal only with the present moment.
hi: हमें न अतीत पर कुढ़ना चाहिए और न ही हमें भविष्य के बारे में चिंतित होना चाहिए; विवेकी व्यक्ति केवल वर्तमान क्षण में ही जीते हैं।

source: A man is great by deeds, not by birth.
hi: “व्यक्ति कर्मों से महान बनता है, जन्म से नहीं।

source: You cannot shake hands with a clenched fist.
hi: आप भींची मुट्ठी से हाथ नहीं मिला सकते।

source: Forgive your enemies, but never forget their names.
hi: अपने दुश्मनों को माफ कर दें, लेकिन उनके नाम कभी न भूलें।

source: People who work sincerely are the happiest.
hi: निष्ठा से काम करने वाले ही सबसे सुखी हैं।

source: Adopt the pace of nature: her secret is patience.
hi: प्रकृति की गति अपनाएं: उसका रहस्य है धीरज।

source: I don't need a friend who changes when I change and who nods when I nod; my shadow does that much better.
hi: मुझे ऐसे मित्र की आवश्यकता नहीं जो मेरे साथ-साथ बदले और मेरी हां में हां भरे; ऐसा तो मेरी परछाई कहीं बेहतर कर लेती है।

source: The power to question is the basis of all human progress.
hi: प्रश्न कर पाने की क्षमता ही मानव प्रगति का आधार है.

source: If you love somebody, let them go, for if they return, they were always yours. And if they don't, they never were.
hi: जिनसे प्रेम करते हैं, उन्हें जाने दें, वे यदि लौट आते हैं तो वे सदा के लिए आपके हैं। और अगर नहीं लौटते हैं तो वे कभी आपके थे ही नहीं।

source: Education's purpose is to replace an empty mind with an open one.
hi: शिक्षा का ध्येय है एक खाली दिमाग को खुले दिमाग में बदलना।

source: Every man dies. Not every man really lives.
hi: हर इंसान मरता है। लेकिन कोई एक ही जीता है।

source: All life is an experiment.
hi: पूरा जीवन एक प्रयोग है।

source: From your parents you learn love and laughter and how to put one foot before the other.
hi: अपने माता पिता से आप प्रेम और हंसी सीखते हैं और पांव पांव चलना भी।

source: Some people, no matter how old they get, never lose their beauty.
hi: कुछ लोग, चाहे जितने बूढ़े हो जाएं, उन की सुंदरता नहीं मिटती।

source: Very often a change of self is needed more than a change of scene.
hi: बहुधा वातावरण में परिवर्तन से कहीं अधिक व्यक्ति के भीतर ही बदलाव की ज़रूरत होती है।

source: You can't have everything. Where would you put it?
hi: आप को सब कुछ नहीं मिल सकता। आप इसे रखेंगे कहां?

source: Good thoughts bear good fruit, bad thoughts bear bad fruit.
hi: सुविचरों से सुफल उपजते हैं और कुविचारों से कुफल।

source: When it comes to staying young, a mind-lift beats a face-lift any day.
hi: सदा जवान रहने के लिए मुख का सौंदर्य नहीं, मस्तिष्क की उड़ान ज़रूरी है।

source: Play is really the work of childhood.
hi: खेल ही वास्तव में बचपन का काम है।

source: Simplicity is making the journey of this life with just baggage enough.
hi: सादगी का मतलब है सीमित बोरिया बिस्तर के साथ ज़िंदगी का सफ़र तय करना।

source: When you betray somebody else, you also betray yourself.
hi: आप किसी व्यक्ति को धोखा देते हैं तो आप अपने आप को भी धोखा देते हैं।

source: It doesn't hurt to be optimistic. You can always cry later.
hi: आशावादी होने में क्या कष्ट है? रो तो कभी भी सकते हैं।

source: Loneliness is the ultimate poverty.
hi: अकेलापन निर्धनता की पराकाष्ठा है।

source: If you want a place in the sun, you've got to put up with a few blisters.
hi: आप आराम की ज़िंदगी चाहते हैं तो आप को कुछ परेशानी तो उठानी ही होगी।

source: There can be no daily democracy without daily citizenship.
hi: नागरिकता के दैनिक व्यवहार के बिना लोकतंत्र का दैनिक निर्वाह हो ही नहीं सकता।

source: What we are seeking so frantically elsewhere may turn out to be the horse we have been riding all along.
hi: हम जिस चीज़ की तलाश कहीं और कर रहे होते हैं वह हो सकता है कि हमारे पास ही हो।

source: Never hesitate to hold out your hand.
hi: अपना हाथ आगे बढ़ाने से कभी मत हिचकिए।

source: Never hesitate to accept the outstretched hand of another.
hi: दूसरे का आगे बढ़ा हाथ थामने से भी कभी मत हिचकिए।

source: The purest affection the heart can hold is the honest love of a nine-year-old.
hi: मन जो स्नेह संजो सकता है उन में से सबसे पवित्र है किसी नौ वर्षीय का निश्छल प्रेम।

source: Happiness, I have discovered, is nearly always a rebound from hard work.
hi: मैंने पाया है कि सुख लगभग हर बार कठोर श्रम की प्रतिक्रिया ही होता है।

source: Friends are those rare people who ask how we are and then wait to hear the answer.
hi: मित्र वे दुर्लभ लोग होते हैं जो हमारा हालचाल पूछते हैं और उत्तर सुनने को रुकते भी हैं।

source: True affluence is to not need anything.
hi: किसी चीज़ की आवश्यकता न रह जाने की स्थिति ही सच्ची समृद्धि है।

source: The secret to staying young is to live honestly, eat slowly, and lie about your age.
hi: युवा बने रहने का रहस्य है ईमानदारी से जीना, धीरे धीरे खाना और अपनी उम्र जाहिर न करना।

source: Now and then it's good to pause in our pursuit of happiness and just be happy.
hi: कभी कभार सुख के पीछे भागना छोड़ कर बस सुखी होना भी एक अच्छी बात है।

source: To carry care to bed is to sleep with a pack on your back.
hi: चिंताएं ले कर बिस्तर पर जाना अपनी पीठ पर गठरी ले कर सोने के समान है।

source: Ninety-nine percent of all failures come from people who have the habit of making excuses.
hi: असफल व्यक्तियों में से निन्यानवे प्रतिशत वे लोग होते हैं जिन की आदत बहाने बनाने की होती है।

source: Love is a game that two can play and both win.
hi: प्यार एक ऐसा खेल है जिसे दो व्यक्ति खेल सकते हैं और जिस में दोनों ही जीतते हैं।

source: Humor is the affectionate communication of insight.
hi: अंतर्दृष्टि का स्नेहमय संवाद है हास्य।

source: It is horrifying that we have to fight our own government to save the environment.
hi: “कितनी भयावह बात है कि हमें पर्यावरण की रक्षा के लिए अपनी ही सरकार से संघर्ष करना पड़ता है।

source: Integrity has no need of rules.
hi: ईमानदारी किसी कायदे कानून की मोहताज़ नहीं होती।

source: We never know the love of a parent till we become parents ourselves.
hi: हम जब तक खुद मां बाप नहीं बन जाएं, मां बाप का प्यार कभी नहीं जान पाते।

source: I may not agree with what you say.
hi: हो सकता है कि मैं आपके विचारों से सहमत न हो पाऊँ

source: One kind word can warm three winter months.
hi: एक मीठा बोल सर्दी के तीन महीनों को ऊष्मा दे सकता है।

source: I like the dreams of the future better than the history of the past.
hi: मुझे तो अतीत के इतिहास से कहीं अच्छे लगते हैं भविष्य के सपने।

source: It is not the man who has too little, but the man who craves more, that is poor.
hi: वह व्यक्ति ग़रीब नहीं है जिस के पास थोड़ा बहुत ही है। ग़रीब तो वह है जो ज़्यादा के लिए मरा जा रहा है।

source: I love life because what more is there.
hi: मैं जीवन से प्यार करता हूँ क्योंकि और है ही क्या।

source: Marriage is a covered dish.
hi: विवाह एक ढका हुआ पकवान है।

source: Friendship is certainly the finest balm for the pangs of disappointed love.
hi: दोस्ती निस्संदेह रूप से निराश प्रेम की कसक के लिए उत्तम मरहम है।

source: Hate the sin, love the sinner.
hi: पाप से नफरत करो, पापी से प्यार.

source: Don't expect anything original from an echo.
hi: प्रतिध्वनि से किसी मौलिकता की आशा मत करो

source: An early-morning walk is a blessing for the whole day.
hi: प्रातःकाल का भ्रमण पूरे दिन के लिए वरदान होता है।

source: The most solid stone in the structure is the lowest one in the foundation.
hi: किसी भी नींव का सबसे मजबूत पत्थर सबसे निचला ही होता है।

source: It is better to risk saving a guilty man than to condemn an innocent one.
hi: किसी निर्दोष को दंडित करने से बेहतर है एक दोषी व्यक्ति को बख़्श देने का जोख़िम उठाना।

source: Luck is a matter of preparation meeting opportunity.
hi: भाग्य अवसर से संयोग की तैयारी भर है।

source: We cannot become what we need to be by remaining what we are.
hi: हम जो हैं वही बने रहकर वह नहीं बन सकते जो कि हम बनना चाहते हैं।

source: There has never been an age that did not applaud the past and lament the present.
hi: ऐसा कोई युग कभी नहीं रहा जिस में अतीत का गुणगान और वर्तमान पर विलाप न किया गया हो।

source: Take a chance! All life is a chance.
hi: जोखिम उठाइये! पूरी जिंदगी एक जोखिम है।

source: The man who goes the furthest is generally the one who is willing to do and dare.
hi: सब से आगे निकलने वाला व्यक्ति सामान्यतया वह होता है जो कर्म और दुस्साहस के लिए इच्छुक रहता है।

source: Skillful listening is the best remedy for loneliness, loquaciousness, and laryngitis.
hi: कुशलतापूर्वक किसी की बात सुनना अकेलेपन, वाचालता और कंठशोथ का सब से बढ़िया इलाज है।

source: What we are is God's gift to us. What we become is our gift to God.
hi: हम जो हैं वह हमें ईश्वर की देन है, हम जो बनते हैं वह परमेश्वर को हमारी देन है।

source: If you would thoroughly know anything, teach it to others.
hi: आप किसी चीज़ का विशद ज्ञान हासिल करना चाहते हैं तो इसे दूसरों को सिखाने लगिए

source: Life is for one generation; a good name is forever.
hi: ज़िंदगी तो कुल एक पीढ़ी भर की होती है, पर नेक काम पीढ़ी दर पीढ़ी चलता है।

source: Almost everything you do will seem insignificant, but it is important that you do it.
hi: आप का कोई भी काम महत्वहीन हो सकता है, किंतु महत्वपूर्ण तो यह है कि आप कुछ करें।

source: What soap is for the body, tears are for the soul.
hi: शरीर के मामले में जो स्थान साबुन का है, वही आत्मा के संदर्भ में आंसू का।

source: Isn't it strange that we talk least about the things we think about most?
hi: है न यह अजीब बात कि हम उन चीज़ों के बारे में सब से कम बात करते हैं जिन के बारे में हम सब से अधिक सोचते हैं।

source: Be like a postage stamp. Stick to one thing until you get there.
hi: डाक टिकट की तरह बनिए, मंजिल पर जब तक न पहुंच जाएं उसी चीज़ पर जमे रहिए।

source: Character is much easier kept than recovered.
hi: चरित्र को बनाए रखना आसान है, उस के भ्रष्ट हो जाने के बाद उसे सुधारना कठिन है।

source: He who is fixed to a star does not change his mind.
hi: जो व्यक्ति किसी तारे से बंधा होता है वह पीछे नहीं मुड़ता।

source: To think too long about doing a thing often becomes its undoing.
hi: किसी काम को करने के बारे में बहुत देर तक सोचते रहना अक़सर उस के बिगड़ जाने का कारण बनता है।
